# identity-api - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/identity/identity-api/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/staging-identity-api/runs/run-nHqtNVsoBYbyGRYk

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.aws_lambda.data.archive_file.default: Refreshing...
module.database_user.random_password.password: Refreshing state... [id=none]
module.database_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.aws_lambda.data.aws_iam_policy_document.default: Refreshing...
module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/lambda-staging-identity-api]
module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=rmn53rf4gi]
module.aws_lambda.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]
module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-identity-api-staging]
module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-identity-api-staging-20230426005736545900000001]
module.aws_lambda.data.archive_file.default: Refresh complete after 1s [id=7a714ac2462de21a3426d4b788dde3c448f22b9c]
module.database_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=staging-cockroachdb-serverless-cluster-id]
module.database_user.cockroach_sql_user.default: Refreshing state... [id=5608cf09-7fa3-44b0-8f67-121a0dc31ca9:staging-identity-api]
module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/api-gateway-staging-identity-api]
module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=lambda-staging-identity-api]
module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=jwkkyjr]
module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=d1m0nc7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "lambda-staging-identity-api"
        tags                           = {
            "domain"        = "identity"
            "environment"   = "staging"
            "resource"      = "identity-api"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "staging-identity"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "staging-identity-api"
    }

  # module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "5608cf09-7fa3-44b0-8f67-121a0dc31ca9:staging-identity-api"
        name       = "staging-identity-api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "4075ff73-5ae1-43c7-a3f5-184ecbe788e5" -> "56a7ea11-5869-45a4-a958-f3713788b2f6"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*